1. Анализ данных начинается здесь
Мы начнём курс с изучения языка Python — основного инструмента аналитика данных.
Чему вы научитесь
В этой теме вы познакомитесь с основами Python: узнаете, как выводить текст на экран, создавать переменные и выполнять с ними математические операции. Это будет не теоретический рассказ. Прямо по ходу обучения вы будете анализировать реальные данные, и в конце представите небольшой отчёт об исследовании.
Сколько времени это займёт
2,5 часа: 19 уроков примерно по 8 минут.

Постановка задачи
На китайском языке говорят больше миллиарда человек, но много ли сайтов на нём написано? А на русском? Чтобы узнать ответы на эти вопросы, мы рассмотрим данные о распространённости языков в мире и в интернете.