#5. Умножение, деление, вычитание
#Аналитик может получить неожиданный результат даже расчётом на калькуляторе. Сравним, к примеру, распространённость языков на Земле с их местом в интернете. Специально для вас мы подготовили сравнение количества владеющих языком и доли сайтов на этом языке среди 10 миллионов самых популярных сайтов в интернете вообще.

# ---- смотрим таблицу сайтов и носителей языка ----------

#Узнаем, сколько англоязычных сайтов оказалось в числе 10 миллионов самых популярных веб-ресурсов. Умножение в Python выполняется оператором * («звёздочка»).
print(0.539 * 10 000 000)
#5390000.0

#А теперь узнаем, какую часть населения планеты составляют носители английского языка. Население мира примем равным 7.539 миллиарда, или 7539 миллионов (по данным census.gov на конец 2018). Деление выполняется оператором / («прямой слеш»):
print(378.2 / 7539)
#0.05016580448335323

#Обратите внимание, что доля носителей английского языка среди землян в 10 раз меньше доли англоязычных сайтов во Всемирной сети. Очевидно, свой вклад вносят те, кто выучил английский язык как иностранный. Давайте установим, сколько их, операцией вычитания. Отнимем число носителей английского от общего количества всех владеющих этим языком:
print(1121 - 378.2)
#742.8

#Смотрите, почти 743 миллиона человек выучили английский. Это может вдохновить тех, кому язык никак не даётся.
