# 9. Новые столбцы (добавление элементов в список)

#Новые столбцы (добавление элементов в список)
#Задача1 / 2
#Добавьте в список названий emoji ещё три следующих элемента, используя метод append(). Выведите результат на экран.

emoji = [
    'Ухмыляюсь', 'Сияю от радости', 'Катаюсь от смеха', 
    'Слёзы радости', 'Подмигиваю'
]

emoji.append('Счастлив') # напишите код вместо многоточия
emoji.append('Глаза-сердца') # напишите код вместо многоточия
emoji.append('Целую') # напишите код вместо многоточия

print(emoji)