#3. Функция print()
#В Python за вывод на экран отвечает команда print():
print('Прочти и запомни')
#Прочти и запомни

# print() — это функция: встроенная в Python программа для определённого действия. 
# Назначение функции print() — вывод на экран (или «печать на экране» на жаргоне программистов). После названия функции в скобках перечисляются её аргументы — данные, с которыми функция должна что-то сделать. Говорят, что аргументы передаются, а функция их принимает. Когда мы пишем имя функции с аргументами, мы её вызываем. Само использование функции называют словом вызов. В нашем примере аргумент — это текст «Прочти и запомни». Обратите внимание, что в Python текст нужно помещать в кавычки, а на экран он выводится без них.
