#4. Операции с числами
#Текст, который вы только что написали – это исходный код программы. Его часто называют просто «программа» или «код». Это набор инструкций. Компьютер выполняет их, если программа написана на понятном ему языке. Например, на Python. В нашем тренажере программа запускается, когда вы нажимаете кнопку «Выполнить код».

#Заголовок исследования есть, теперь пора считать. Python умеет оперировать числами как обычный калькулятор. Для анализа мы взяли список языков, на которых написано не менее 100 тысяч сайтов из 10 миллионов самых посещаемых в интернете. Давайте посчитаем суммарное количество носителей всех славянских языков из выбранных: русского, польского и чешского языков в миллионах:

print(153.9 + 39.6 + 10.4)

#Обратите внимание, что в Python разделитель десятичной дроби – не запятая, а точка.
#В этой программе плюс не простой знак, а команда языка программирования, или оператор. Арифметические операторы принято отделять пробелами: такой код легче читать.

#Хорошо:
print(153.9 + 39.6 + 10.4)

#Плохо:
print(153.9+39.6+10.4)