11. Заключение

Выводы из данных
Название эмодзи  | Emojixpress, млн
-----------------------------------
Слёзы радости    |           233.00
Сердце           |           118.00
Целую            |            87.50
Глаза-сердца     |            64.60
Катаюсь от смеха |            25.60


Название эмодзи  | Instagram, млн
---------------------------------
Сердце           |          26.00
Глаза-сердца     |          11.20
Слёзы радости    |           7.31
Два сердца       |           5.69
Целую            |           5.13


Название эмодзи  | Твиттер, млн
-------------------------------
Слёзы радости    |      2270.00
Сердце           |      1080.00
Переработка      |       932.00
Глаза-сердца     |       834.00
Червы            |       697.00


Название эмодзи  | Индекс использования
---------------------------------------
Слёзы радости    |                13.23
Сердце           |                11.95
Глаза-сердца     |                 6.31
Целую            |                 4.66
Счастлив         |                 2.87

Какие выводы можно сделать из нашего исследования?
* Самые популярные эмодзи связаны с положительными эмоциями — весельем и любовью.
* На разных платформах порядок и выбор эмодзи немного отличается, но самые популярные эмодзи везде похожи.
* Отдельные ресурсы имеют свои особенности, которые генерируют статистические выбросы, как в случае с символом переработки в Твиттере. От артефактов можно избавиться сбором значений со всех платформ и нормированием.

Что дальше
Первое исследование закончилось так успешно, что его результат можно смело показывать профессионалам. Вот вы подтвердили гипотезу статистикой. Научились превращать списки в таблицы и сортировать значения, находить среди них выдающиеся. Скажете, так может безо всякого языка Python любая программа работы с таблицами в стандартном офисном пакете? Да, но владеть языком программирования хорошо потому, что вы сможете сделать думающую таблицу, где сами напишете функции под свои собственные задачи. Такие, которых ни у кого нет. Да ещё способные принимать решения в зависимости от величины значений. В следующей теме мы научимся ставить программе условия и делать собственные «программы в программе» — функции. Вперёд! Вы на пороге настоящего программирования.