16. Формулировка выводов
Получили такую таблицу:
Годы      | Рейтинг | Длина  | Бюджет за минуту | Сборы 
--------------------------------------------------------
1988-1998 |    8.24 | 152.20 |             0.28 | 498.31
1998-2008 |    8.10 | 136.20 |             0.34 | 361.93
2008-2018 |    7.43 | 119.40 |             0.15 | 183.73
Из таблицы мы можем заключить:
* фильмы становятся короче;
* дешевле;
* их зрительский рейтинг падает;
* а сборы уменьшаются.

Первый вывод, который напрашивается: фильмы становятся хуже. Но такое рассуждение было бы огульным: мы не учитываем контекст времени и динамику рынка кинематографа. Более точная гипотеза — вкусы киноакадемии уходят от коммерчески успешного кино в сторону «фестивального» кино.