2. Задача: новые возможности в сервисе Яндекс.Музыка
Картинка 1

Мы готовим к запуску новый релиз, где соединим вместе приложения Музыка и Радио. Нам важно понимать, как пользователи отреагируют на такое новшество. Для этого мы оцениваем на небольшом количестве пользователей, насколько им понравилась возможность быстрого доступа к Радио.

Каждая компания по-разному оценивает реакцию пользователя на нововведения. Продуктовые исследования в нашем сервисе показали, что среднее время прослушивания лучше всего отражает лояльность пользователей.

Метрика удовлетворенности пользователя сервисом называется happiness (англ. happiness, «счастье»). В Яндекс.Музыке метрика happiness равна среднему времени прослушивания треков. Чем выше этот показатель, тем больше доволен пользователь.

Картинка 2

Есть и другие метрики, которые помогают ответить на вопрос: «Как дела у нашего продукта?»

Если метрика happiness в эксперименте повысится, команда примет решение добавить Радио всем пользователям.

Ваша задача как аналитика Яндекс.Музыки определить текущее значение метрики happiness. Вы пройдёте все стадии – от знакомства с данными до решения бизнес-задачи.