17. Заключение
Выводы из данных
* Оскароносные фильмы становятся короче, дешевле и при этом у них понижается пользовательский рейтинг и сборы. Вкусы киноакадемии всё больше двигаются в сторону искусства и всё дальше уходят от кино как бизнеса.

* Мелодрама — самый дорогой и прибыльный жанр. Это связано с его популярностью и высокими гонорарами актёров. Также большой вклад внёс фильм «Титаник» с большим бюджетом и сборами.

* Криминальные фильмы и триллеры самые короткие и приносят кинокомпаниям меньше всего денег. Вероятно, причина этого – высокое напряжение, которое тяжело долго выдерживать и не всем по нраву.

Что дальше
Первая бизнес-задача, похожая на реальную: анализ данных Яндекс.Музыки и оценка результатов поставленного на этом сервисе эксперимента. Вы познакомитесь с библиотекой Pandas, которая позволит перейти от учебных табличек к реальным выборкам.

Забери с собой
Чтобы ничего не забыть, скачайте шпаргалку