11. Формулировка выводов
Мы получили вот такой результат:
Жанр      | Рейтинг | Длина  | ROI   | Бюджет за минуту
-------------------------------------------------------
история   |    7.86 | 143.14 |  9.48 |             0.18
мелодрама |    8.12 | 137.86 | 10.84 |             0.36
криминал  |    7.93 | 122.83 |  7.47 |             0.26
биография |    8.14 | 146.50 |  9.78 |             0.27
триллер   |    7.87 | 123.50 |  7.01 |             0.25

Какие выводы можно сделать из таблицы:
* Самые дорогие и прибыльные фильмы — мелодрамы. В них снимаются самые дорогие звёзды — это одновременно объясняет и высокий бюджет, и прибыльность фильмов. Ещё большой вклад в общую картину внёс фильм «Титаник» с монструозно высокими бюджетом и сборами.
* Криминальные фильмы и триллеры наименее длинные и прибыльные. Вероятно, невозможно удерживать накал слишком долго: у человека есть физиологические ограничения. При этом высокое напряжение — удовольствие на любителя, и некоторые люди просто не смотрят такие фильмы.
* Исторические фильмы — самые дешёвые. Быть может, потому, что исторический фильм всегда найдёт своего зрителя. Ведь знаменитости из прошлого сами по себе — бренд; можно сэкономить на актёрском составе и музыке.

Каждая из гипотез тянет на отдельное исследование. Возможно, когда-нибудь мы к ним вернёмся. А сейчас продолжим изучать вкусы киноакадемии.