Pandas для анализа данных

Библиотека Pandas сокращает размер кода и его сложность; превращает данные из потока в организованную структуру, приспособленную для обработки специальными методами. Теперь можно работать с большими объёмами данных и от учебных табличек перейти к реальным выборкам, с которыми вы столкнётесь в бизнесе.

1. Анализ данных продолжается здесь

Данные исследуют в четыре стадии:
- Получение данных и ознакомление с ними
- Предподготовка данных
- Анализ данных
- Оформление результатов исследования

В этой теме мы начнём с первой стадии. В получении данных и ознакомлении с ними важную роль выполняет библиотека Pandas.

Чему вы научитесь
Познакомитесь с библиотекой Pandas и её базовыми методами: чтением файла, выводом данных на экран, получением сводной информации и запросом значений из определённых ячеек таблицы.

Сколько времени это займёт
2 часа = 6 уроков от 2 до 30 минут.

Постановка задачи
Решим задачу из реальной практики сервиса Яндекс.Музыка: исследовать предпочтения пользователей и ответить на вопрос, целесообразна ли интеграция двух сервисов — Музыки и Радио.