# Тема. Операции с таблицами


#1. Наглядность и лаконичность
#Мы научимся управлять данными в таблицах и получим новые инструменты для их анализа.

#Чему вы научитесь
#Сортировать данные в таблицах, добавлять новые столбцы и выбирать интересные строки.

#Сколько времени это займёт
#2,5 часа: 12 уроков примерно по 12 минут.

#Постановка задачи
#Продолжим исследовать употребление эмодзи на разных платформах и установим, какие чувства чаще всего выражают подобными символами. Проверим нашу рабочую гипотезу о преобладании эмодзи, поднимающих настроение.